# HasParameter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..HasParameter Method
Subelement Class See Also
---
Checks if this subelement have given parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool HasParameter(
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Function HasParameter ( _
	parameterId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool HasParameter(
	ElementId^ parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId Parameter id.
# ### Return Value
True if %parameterId% identifies valid parameter of this subelement, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Subelement Class
Autodesk.Revit.DB Namespace